#ifndef _COMMON_H_
#define _COMMON_H_
/************************************************************************************/
/*		FILE: common.h									  						*/
/*		Ver. 1.0																	*/
/*		DATE: 2023/12/26																*/
/*																					*/
/*		enPiT-Reskill Emb															*/
/*		PBL 課題1 Zumoコマンド走行プログラム										*/
/*		Copyright (C) Graduate School of Information Science, Nagoya Univ., JAPAN	*/
/************************************************************************************/

/************************/
/*		マクロ定義		*/
/************************/
/* 評価環境 */
#define SIMULATION_ENV				(1)					/* 0以外:シミュレーション環境。0:実機環境   */
#define SIM_DEBUG_CONSOLE			(0)					/* 0:デバッグコンソール無効 / 0以外:デバッグコンソール有効 */

/************************/
/*		extern宣言		*/
/************************/
extern	int g_iDoCmdNum;    /* 制御コマンド格納配列のインデックス	*/

#endif